## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                     NAME                                     |
|----------|------------------------------------------------------------------------------|
| update   | `aws_docdb_cluster.ai-answers-docdb-cluster`                                 |
|          | `aws_docdb_subnet_group.ai-answers-docdb-subnet-group`                       |
|          | `aws_security_group.ai-answers-docdb-sg`                                     |
| recreate | `aws_docdb_cluster_parameter_group.ai-answers-docdb-cluster-parameter-group` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_docdb_cluster.ai-answers-docdb-cluster will be updated in-place
  ~ resource "aws_docdb_cluster" "ai-answers-docdb-cluster" {
      ~ db_cluster_parameter_group_name = "ai-asnwers-docdb-cluster-parameter-group" -> "ai-answers-docdb-cluster-parameter-group"
        id                              = "ai-answers-docdb-cluster"
        tags                            = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (28 unchanged attributes hidden)
    }

  # aws_docdb_cluster_parameter_group.ai-answers-docdb-cluster-parameter-group must be replaced
-/+ resource "aws_docdb_cluster_parameter_group" "ai-answers-docdb-cluster-parameter-group" {
      ~ arn         = "arn:aws:rds:ca-central-1:992382783569:cluster-pg:ai-asnwers-docdb-cluster-parameter-group" -> (known after apply)
      ~ description = "Parameter group for DocumentDB" -> "Parameter group for ai-answers staging DocumentDB" # forces replacement
      ~ id          = "ai-asnwers-docdb-cluster-parameter-group" -> (known after apply)
      ~ name        = "ai-asnwers-docdb-cluster-parameter-group" -> "ai-answers-docdb-cluster-parameter-group" # forces replacement
      + name_prefix = (known after apply)
        tags        = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_docdb_subnet_group.ai-answers-docdb-subnet-group will be updated in-place
  ~ resource "aws_docdb_subnet_group" "ai-answers-docdb-subnet-group" {
      ~ description = "Subnet group for DocumentDB for the AI Answers app" -> "Subnet group for DocumentDB for the ai-answers staging app"
        id          = "ai-answers-example-docdb-subnet-group"
        name        = "ai-answers-example-docdb-subnet-group"
        tags        = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.ai-answers-docdb-sg will be updated in-place
  ~ resource "aws_security_group" "ai-answers-docdb-sg" {
        id                     = "sg-04966047bf236b850"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 27017
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow DocumentDB cluster to receive requests from ECS"
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-085c606383f33733e",
                ]
              - self             = false
              - to_port          = 27017
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
        name                   = "ai-answers-example-docdb-sg"
        tags                   = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.docdb_uri"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
